backend/controllers/DanhMucController.php

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`='48'
---
    protected function findModel($id)
    {
        if (($model = DanhMuc::findOne($id)) !== null) {

SELECT * FROM `qlcvsd_danh_muc` WHERE (`active`=1) AND (`parent_id`='9')
---
    public function actionTimPhongO()
    {
        if(!isset($_POST['ngayTu'])){
            $phongos = DanhMuc::findAll(['active' => 1, 'parent_id' => $_POST['idToaNha']]);
        }else{
            $ngayTu = DateTime::createFromFormat('d/m/Y H:i', $_POST['ngayTu'])->format('Y-m-d H:i:s');
            $ngayDen = DateTime::createFromFormat('d/m/Y H:i', $_POST['ngayDen'])->format('Y-m-d H:i:s');

            $phongos = \backend\models\DanhMuc::find()
                ->alias('dm')
                ->andFilterWhere(['dm.parent_id' => $_POST['idToaNha']])
                ->andFilterWhere(['dm.active' => 1])
                ->leftJoin('qlcvsd_phong_khach qlpk', 'qlpk.phong_id = dm.id')
                ->andWhere([
                    'or',
                    ['qlpk.phong_id' => null],
                    [
                        'and',
                        ['or',
                            ['<', 'qlpk.thoi_gian_hop_dong_den', $ngayTu],
                            ['>', 'qlpk.thoi_gian_hop_dong_tu', $ngayDen],
                        ],
                        ['!=', 'qlpk.trang_thai', PhongKhach::HOAN_THANH],
                        ['qlpk.active' => 1]
                    ]
                ])
                ->all();
        }
        $phongos = DanhMuc::findAll(['active' => 1, 'parent_id' => $_POST['idToaNha']]);

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`=''
---
    public function actionGetDonGiaPhong()
    {
        $model = DanhMuc::findOne($_POST['idPhong']);

SELECT * FROM `qlcvsd_phieu_chi` WHERE (`thang`='5') AND (`nam`='2025') AND (`active`=1) AND (`toa_nha_id`=9)
SELECT * FROM `qlcvsd_chi_tiet_chi_phi` WHERE `phieu_chi_id`=6
---
    public function actionGetChiPhi()
    {
        $thang = $_POST['thang'];
        $nam = $_POST['nam'];

        $phieuChi = PhieuChi::findOne([
            'thang' => $thang,
            'nam' => $nam,
            'active' => 1,
            'toa_nha_id' => intval($_POST['toaNhaID'])
        ]);

        if (is_null($phieuChi)){
            $phieuChi = new PhieuChi();
            $phieuChi->thang = $thang;
            $phieuChi->nam = $nam;
            $phieuChi->toa_nha_id = intval($_POST['toaNhaID']);
            $phieuChi->save();
        }
        Yii::$app->response->format = Response::FORMAT_JSON;
        $chiTiets = ChiTietChiPhi::findAll(['phieu_chi_id' => $phieuChi->id]);

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`='48'
SELECT * FROM `qlcvsd_quan_ly_phong_khach` WHERE (`phong_id`=48) AND (`active`=1)
---
    public function actionGetLichDat($id)
    {
        $phong = DanhMuc::findOne($id);
        Yii::$app->response->format = Response::FORMAT_JSON;
        $hopDongs = QuanLyPhongKhach::find()
            ->andFilterWhere(['phong_id'=>$phong->id])
            ->andFilterWhere(['active'=>1])->all();

SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active = 1
SELECT * FROM `qlcvsd_danh_muc` WHERE `active`=1 ORDER BY `id`
SELECT SUM(so_tien_moi_gioi) FROM `qlcvsd_quan_ly_phong_khach` WHERE ((`toa_nha_id`=9) AND (`active`=1)) AND (`so_tien_moi_gioi` > 0) AND (MONTH(thoi_gian_hop_dong_tu)=4) AND (YEAR(thoi_gian_hop_dong_tu)=2025)
---
    public function actionMoiGioi()
    {
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active = 1')->all(),
            'id',
            'name'
        );

        $thangs = array_combine(range(1, 12), range(1, 12));
        $nams = array_combine(range(2000, 2050), range(2000, 2050));

        $toaNhaID = DanhMuc::find()
            ->andFilterWhere(['active' => 1])
            ->orderBy(['id' => SORT_ASC])
            ->one();
        $thangTruoc = strtotime("-1 month");
        $query = QuanLyPhongKhach::find()
            ->where(['toa_nha_id' => $toaNhaID->id, 'active' => 1])
            ->andWhere(['>','so_tien_moi_gioi',0])
            ->andWhere(['MONTH(thoi_gian_hop_dong_tu)' => (int)date('m', $thangTruoc)])
            ->andWhere(['YEAR(thoi_gian_hop_dong_tu)' => (int)date('Y', $thangTruoc)]);

SELECT SUM(so_tien_moi_gioi) FROM `qlcvsd_quan_ly_phong_khach` WHERE ((`toa_nha_id`='9') AND (`active`=1)) AND (`so_tien_moi_gioi` > 0) AND (MONTH(thoi_gian_hop_dong_tu)=4) AND (YEAR(thoi_gian_hop_dong_tu)=2025)
---
    public function actionThongKeMoiGioi()
    {
        $toaNhaID = $_POST['toaNhaID'];
        $phongID = $_POST['phongID'];
        $thang = intval($_POST['thang']);
        $nam = intval($_POST['nam']);
        $loai = $_POST['loai'];

        $thangTruoc = $thang - 1 == 0 ? 12 : $thang - 1;
        $nam = $thangTruoc == 12 ? $nam - 1 : $nam;

        $operator = ($loai == 'con no') ? '>=' : '<';

        $query = QuanLyPhongKhach::find()
            ->where(['toa_nha_id' => $toaNhaID, 'active' => 1])
            ->andWhere(['>','so_tien_moi_gioi',0])
            ->andWhere(['MONTH(thoi_gian_hop_dong_tu)' => $thangTruoc])
            ->andWhere(['YEAR(thoi_gian_hop_dong_tu)' => $nam]);

SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active = 1
SELECT * FROM `qlcvsd_danh_muc` WHERE `active`=1 ORDER BY `id`
---
    public function actionChiPhi()
    {
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active = 1')->all(),
            'id',
            'name'
        );
        $toaNhaID = DanhMuc::find()
            ->andFilterWhere(['active' => 1])
            ->orderBy(['id' => SORT_ASC])
            ->one();

SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active = 1
SELECT * FROM `qlcvsd_danh_muc` WHERE `active`=1 ORDER BY `id`
SELECT SUM(da_thanh_toan) FROM `qlcvsd_quan_ly_hoa_don` WHERE (`active`=1) AND (`thang`=5) AND (`nam`=2025) AND (`parent_id`=9)
SELECT * FROM `qlcvsd_phieu_chi` WHERE (`active`=1) AND (`thang`=5) AND (`nam`=2025) AND (`toa_nha_id`=9)
SELECT SUM(da_thanh_toan) FROM `qlcvsd_chi_tiet_chi_phi` WHERE `phieu_chi_id`=6
---
    public function actionTongHop()
    {
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active = 1')->all(),
            'id',
            'name'
        );
        $toaNhaID = DanhMuc::find()
            ->andFilterWhere(['active' => 1])
            ->orderBy(['id' => SORT_ASC])
            ->one()->id;
        $tongThu = QuanLyHoaDon::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['thang' => (int)date('m')])
            ->andFilterWhere(['nam' => (int)date('Y')])
            ->andFilterWhere(['parent_id' => $toaNhaID])
            ->sum('da_thanh_toan') ?? 0;
        $phieuChis = PhieuChi::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['thang' => (int)date('m')])
            ->andFilterWhere(['nam' => (int)date('Y')])
            ->andFilterWhere(['toa_nha_id' => $toaNhaID])->all();
        $tongChi = 0;
        foreach($phieuChis as $phieuChi){
            $tongChi += ChiTietChiPhi::find()
                ->andFilterWhere(['phieu_chi_id' => $phieuChi->id])
                ->sum('da_thanh_toan') ?? 0;

SELECT SUM(da_thanh_toan) FROM `qlcvsd_quan_ly_hoa_don` WHERE (`active`=1) AND (`thang`=9) AND (`nam`=2024) AND (`parent_id`='9')
SELECT * FROM `qlcvsd_phieu_chi` WHERE (`active`=1) AND (`thang`=9) AND (`nam`=2024) AND (`toa_nha_id`='9')
SELECT SUM(da_thanh_toan) FROM `qlcvsd_chi_tiet_chi_phi` WHERE `phieu_chi_id`=1
---
    public function actionGetChartData()
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $timeIndex = strtotime('2024-09-01');
        $timeNow = strtotime('now');
        $chartDatas = [];

        $dataThu = [];
        $dataChi = [];
        $dataLoiNhuan = [];
        while($timeIndex <= $timeNow){
            $queryThu = QuanLyHoaDon::find()
                ->andFilterWhere(['active' => 1])
                ->andFilterWhere(['thang' => (int)date('m', $timeIndex)])
                ->andFilterWhere(['nam' => (int)date('Y', $timeIndex)]);
            if (!empty($_POST['toaNhaID'])) {
                $queryThu->andFilterWhere(['parent_id' => $_POST['toaNhaID']]);
            }
            $tongThu = $queryThu->sum('da_thanh_toan') ?? 0;

            $queryChi = PhieuChi::find()
                ->andFilterWhere(['active' => 1])
                ->andFilterWhere(['thang' => (int)date('m', $timeIndex)])
                ->andFilterWhere(['nam' => (int)date('Y', $timeIndex)]);
            if (!empty($_POST['toaNhaID'])) {
                $queryChi->andFilterWhere(['toa_nha_id' => $_POST['toaNhaID']]);
            }
            $phieuChis = $queryChi->all();
            $tongChi = 0;
            foreach($phieuChis as $phieuChi){
                $tongChi += ChiTietChiPhi::find()
                    ->andFilterWhere(['phieu_chi_id' => $phieuChi->id])
                    ->sum('da_thanh_toan') ?? 0;