backend/controllers/HoaDonController.php

SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active = 1
SELECT * FROM `qlcvsd_danh_muc` WHERE `active`=1 ORDER BY `id`
SELECT * FROM `qlcvsd_quan_ly_hoa_don` WHERE (`active`=1) AND (`parent_id` IN (9, 'Tòa 90D3', 'Toà nhà', 1, 0, '[{\"label\":\"Rác\",\"name\":\"rac\",\"value\":\"30000\"},{\"label\":\"Internet\",\"name\":\"internet\",\"value\":\"100000\"},{\"label\":\"Giặt\",\"name\":\"giat\",\"value\":\"100000\"}]', 0, 1, 1, 3500, 15000, 0, 0, 100000) OR `parent_id` IS NULL) AND (`thang`='5') AND (`nam`='2025') AND (`da_thanh_toan` < 'tong_tien')
---
    public function actionCongNo()
    {
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active = 1')->all(),
            'id',
            'name'
        );

        $thangs = array_combine(range(1, 12), range(1, 12));
        $nams = array_combine(range(2000, 2050), range(2000, 2050));

        $toaNhaID = DanhMuc::find()
            ->andFilterWhere(['active' => 1])
            ->orderBy(['id' => SORT_ASC])
            ->one();

        $thangTruoc = date('n');
        $namHienTai = date('Y');

        $hoaDons = QuanLyHoaDon::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['parent_id' => $toaNhaID])
            ->andFilterWhere(['thang' => $thangTruoc])
            ->andFilterWhere(['nam' => $namHienTai])
            ->andFilterWhere(['<', 'da_thanh_toan', 'tong_tien'])
            ->all();

SELECT * FROM `qlcvsd_quan_ly_hoa_don` WHERE (`active`=1) AND (`parent_id` IN (9, 'Tòa 90D3', 'Toà nhà', 1, 0, '[{\"label\":\"Rác\",\"name\":\"rac\",\"value\":\"30000\"},{\"label\":\"Internet\",\"name\":\"internet\",\"value\":\"100000\"},{\"label\":\"Giặt\",\"name\":\"giat\",\"value\":\"100000\"}]', 0, 1, 1, 3500, 15000, 0, 0, 100000) OR `parent_id` IS NULL) AND (`thang`='5') AND (`nam`='2025') AND (`da_thanh_toan` >= 'tong_tien')
---
            $conNo += $hoaDon->tong_tien - $hoaDon->da_thanh_toan;
            $daThanhToan += $hoaDon->da_thanh_toan;
        }
        $hoaDonDaTT = QuanLyHoaDon::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['parent_id' => $toaNhaID])
            ->andFilterWhere(['thang' => $thangTruoc])
            ->andFilterWhere(['nam' => $namHienTai])
            ->andFilterWhere(['>=', 'da_thanh_toan', 'tong_tien'])
            ->all();

SELECT SUM(tong_tien) FROM `qlcvsd_quan_ly_hoa_don` WHERE (`active`=1) AND (`parent_id`='9') AND (`thang`=5) AND (`nam`=2025)
---
    public function actionThongKe()
    {
        $toaNhaID = $_POST['toaNhaID'];
        $phongID = $_POST['phongID'];
        $thang = intval($_POST['thang']);
        $nam = intval($_POST['nam']);
        $loai = $_POST['loai'];

        $operator = ($loai == 'con no') ? '>=' : '<';

        $query = QuanLyHoaDon::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['parent_id' => $toaNhaID])
            ->andFilterWhere(['thang' => $thang])
            ->andFilterWhere(['nam' => $nam]);