backend/controllers/PhongKhachController.php

    public function actionCreate()
    {
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active = 1')->all(),
            'id',
            'name'
        );
---
SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active = 1