backend/controllers/UserController.php

SELECT * FROM `qlcvsd_vaitro_user` WHERE `user_id`='134'
---
    public function actionUpdate($id){

        $request = Yii::$app->request;
        $model = $this->findModel($id);
        $hinhAnhCu = $model->anhdaidien;
        $vaitros = ArrayHelper::map(Vaitrouser::findAll(['user_id' => $id]), 'vai_tro_id', 'vai_tro_id');