common/models/myAPI.php

    public static function isAccess2($controller, $action, $uid = null ){
        if(is_null($uid)){
            if(Yii::$app->user->isGuest)
                return false;
            else{
//                if(Yii::$app->user->identity->getId() == 1)
//                    return true;
                $action = ucfirst($action);
                $controller_action = "{$controller};{$action}";
                $user_id = Yii::$app->user->id;
                return !is_null(QuanLyPhanQuyen::findOne(['controller_action' => $controller_action, 'user_id' => $user_id]));
---
SELECT * FROM `qlcvsd_quan_ly_phan_quyen` WHERE (`controller_action`='User;Khach-hang') AND (`user_id`=1)