backend/themes/qltk2/danh-muc/toa-nha-phong-o/_columns.php

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`=43
---
        'label' => 'Toà nhà',
        'value' => function($data){
    /** @var \backend\models\DanhMuc $data */
            return $data->parent_id != '' ? \backend\models\DanhMuc::findOne($data->parent_id)->name : '';