backend/themes/qltk2/danh-muc/toa-nha-phong-o/_form.php

SELECT * FROM `qlcvsd_danh_muc` WHERE `type`='Toà nhà'
---
            ], ['prompt' => '-- Chọn --'])->label('Phân loại <span class="text-danger">*</span>') ?>
        </div>
        <div class="col-md-4">
            <?= $form->field($model, 'parent_id')->dropDownList(
                \yii\helpers\ArrayHelper::map(\backend\models\DanhMuc::findAll(['type' => \backend\models\DanhMuc::TOA_NHA]), 'id', 'name'), ['prompt' => '-- Chọn --']
            )->label('Toà nhà') ?>